#language:ru

Функциональность: Выбор товаров в интернет-магазине.

  @all @first
  Сценарий: Добавление в корзину и удаление из неё товаров.

  * Выполнить поиск по "iphone".
  * Ограничить цену до 100000.
  * Отметить чекбоксы:
    |Высокий рейтинг|
    |NFC|
  * Добавить в корзину из результатов поиска "первые 8" "нечётных".
  * Перейти в корзину.
  * Проверить, что все добавленные ранее товары находятся в корзине.
  * Проверить, что отображается текст "Ваша корзина - 8 товаров".
  * Убрать все товары из корзины.
  * Проверить, что корзина не содержит никаких товаров.


  @all @second
  Сценарий: Добавление в корзину и удаление из неё товаров.

  * Выполнить поиск по "бепроводные наушники".
  * Ограничить цену до 10000.
  * Отметить чекбоксы:
#    |Beats|
#    |Samsung|
    |Высокий рейтинг|
  * Добавить в корзину из результатов поиска "все" "нечётные".
  * Перейти в корзину.
  * Проверить, что все добавленные ранее товары находятся в корзине.
  * Проверить, что отображается текст "Ваша корзина - 8 товаров".
  * Убрать все товары из корзины.
  * Проверить, что корзина не содержит никаких товаров.
